---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.SheetLength
source: html/becaf11a-0e64-3f89-c0ff-2cef5853ba1c.htm
---
# Autodesk.Revit.DB.SpecTypeId.SheetLength Property

Sheet Length, in discipline Common.

## Syntax (C#)
```csharp
public static ForgeTypeId SheetLength { get; }
```